def test_1():
    assert 2==2


# поиск по ключевому слову (Маленький принц)
# поиск с пустой строкой?
# поиск со спецсимволами (!@#$%)
# открытие категории «Книги» → проверка URL и заголовка
# фильтр по цене (от 500 до 1000 руб.) → проверка, что все цены в диапазоне
# фильтр по автору
# добавление 1 книги → проверка счётчика в корзине
# добавление 3 разных книг в корзину → проверка количества
# удаление книги из корзины → проверка, что корзина пустеет
# изменение количества книг (2 шт.) → проверка обновления суммы
